test/site/content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval never-export

#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@
#+macro: youtube @@html:<div class="org-youtube"><iframe src="https://www.youtube-nocookie.com/embed/$1" allowfullscreen title="YouTube Video"></iframe></div>@@

#+bibliography: cite/bib/orgcite.bib

#+author:

** Escaping hashes and exclamations correctly in body              :escaping:
:PROPERTIES:
:EXPORT_FILE_NAME: escaping-hashes-and-exclamations-in-body
:END:
I intend to show these # characters verbatim; they should not render
as Markdown headings. They also shouldn't show up with a leading =\=
in the final rendered output.

# This is an Org comment

#This is not an Org comment. It has a hash char at beginning of a
paragraph which must be escaped just once i.e. show up as =\#= in
Markdown.

blah # This isn't an Org comment either

This * will be escaped just once i.e. show up as =\*= in Markdown.

This _ will not be escaped as it's a solo underscore character. But
the following underscore will be escaped: something_.

This \ will be escaped just once i.e. show up as =\\= in Markdown.

Hash char at beginning of a continued line
#like this must be escaped just once i.e. show up as =\#= in Markdown.

![this exclamation must be escaped just once i.e. show up as =\!= in
Markdown]

This ! does not need to be escaped as there is no ambiguity.
